party_platter/app/controllers/api/v1/campaigns_controller.rb

SELECT "campaigns".* FROM "campaigns"
---
    def index
        campaign = Campaign.all

INSERT INTO "campaigns" ("id", "created_by", "name", "minplayers", "maxplayers", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7)  [["id", nil], ["created_by", nil], ["name", "Dungeon Diver 2"], ["minplayers", 3], ["maxplayers", 7], ["created_at", "2022-10-31"], ["updated_at", "2022-10-31"]]
---
    def create
        campaign = Campaign.new(campaign_params)
        if campaign.save

SELECT "campaigns".* FROM "campaigns" WHERE "campaigns"."camp_id" = $1 LIMIT $2  [["camp_id", 1], ["LIMIT", 1]]
---
    def show
        campaign = Campaign.find(params[:id])

SELECT "campaigns".* FROM "campaigns" WHERE "campaigns"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "campaigns" WHERE "campaigns"."id" = $1  [["id", 3]]
---
    def destroy
        campaign = Campaign.find(params[:id])

        # add in methods to also destroy related memberships

        if campaign.destroy!

SELECT "campaigns".* FROM "campaigns" WHERE "campaigns"."camp_id" = $1 LIMIT $2  [["camp_id", 1], ["LIMIT", 1]]
UPDATE "campaigns" SET "minplayers" = $1 WHERE "campaigns"."camp_id" = $2  [["minplayers", 2], ["camp_id", 1]]
---
    def update
        campaign = Campaign.find(params[:id])

        if campaign.update!(campaign_params)

SELECT "campaigns".* FROM "campaigns" WHERE "campaigns"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "characters".* FROM "characters" WHERE "characters"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "memberships" ("campaign_id", "character_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["campaign_id", 1], ["character_id", 23], ["created_at", "2022-11-21 23:02:20.500492"], ["updated_at", "2022-11-21 23:02:20.500492"]]
---
    def add_character
        #campaign id is in url, character id gets passed in params
            #add_character_api_v1_campaign_path(:id)
        #make a join table **
            #is a permanent table(migration) **
        #add the join table as a model **
        #update the activerecord references in campaings, characters, and join table model **??
        #make controller do what it needs to do


        # membership = Membership.find_by(params[:campaign_id])
        # puts(membership.to_json)
        # puts(member_params)
        # if membership.update!(member_params)
        #     render json: {status: "Success!", message: "Member added!"}, status: :ok
        # else
        #     render json: {status: "Failure!", message: "Member not added!"}, status: :unprocessable_entity
        # end

        @campaign = Campaign.find(params[:id])
        @character = Character.find(params[:character_id])
        membership = Membership.new({campaign_id: @campaign.id, character_id: @character.id})
        if membership.save!#(member_params)