party_platter/app/controllers/api/v1/characters_controller.rb

SELECT "characters".* FROM "characters"
---
    def index
        characters = Character.all

INSERT INTO "characters" ("name", "user_id", "strength", "dexterity", "constitution", "intelligence", "wisdom", "charisma", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
---
    def create
        character = Character.new(character_params)

        if character.save

SELECT "characters".* FROM "characters" WHERE "characters"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
---
    def show
        character = Character.find(params[:id])

SELECT "characters".* FROM "characters" WHERE "characters"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
DELETE FROM "characters" WHERE "characters"."id" = $1  [["id", 8]]
---
    def destroy
        character = Character.find(params[:id])

        if character.destroy!

SELECT "characters".* FROM "characters" WHERE "characters"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
UPDATE "characters" SET "name" = $1, "updated_at" = $2 WHERE "characters"."id" = $3  [["name", "PostTest3"], ["updated_at", "2022-10-31"], ["id", 10]]
---
    def update
        character = Character.find(params[:id])

        if character.update!(character_params)